# Data Input and Output
This notebook contains the reference code for getting input nad output using pandas. Pandas can read a variety of file types using its pd.read_ methods.

In [46]:
import numpy as np
import pandas as pd

<hr>

## CSV

### CSV Input

In [51]:
df = pd.read_csv('used_files/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [52]:
df.to_csv('used_files/my_CSV_output.csv', index=False)

<hr>

## Excel
Pandas can read and write excel files.
NOTE: This only imports data. Not formulas or images, having images or macros may cause read_excel method to crash.

### Excel Input

In [55]:
pd.read_excel('used_files/Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Excel Output

In [58]:
df.to_excel('used_files/my_Excel_output.xlsx', sheet_name='Sheet1')

<hr>

## HTML
Pandas can read tables off of HTML, using htmllib5, xml, and BeautifulSoup4.

### HTML Input

In [60]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [61]:
df[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
...,...,...,...,...,...,...,...
561,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
562,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
563,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
564,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
565,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

<hr>